lfariazzz/tcc-monitoramento_preditivo_vibroacustico/firmware/sdkconfig.defaults
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.5.5 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"

# Task Watchdog Timer (TWDT): 5 s gives margin over RNF-06 (< 2 s)
# while still recovering quickly from stalled acquisition/inference tasks.
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
